#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_api_gateway_method.post_method: Refreshing state... [id=agm-jdub5r46se-tqiml1-POST]
aws_acm_certificate.thomaskimble_certificate: Refreshing state... [id=arn:aws:acm:eu-west-1:287212251408:certificate/29037fba-829c-4870-9979-4b1574a8c6fd]
aws_api_gateway_rest_api.thomaskimble: Refreshing state... [id=jdub5r46se]
aws_route53_zone.thomaskimble_zone: Refreshing state... [id=Z06242472H0DG7GFLG30T]
aws_api_gateway_method_response.post_method_response: Refreshing state... [id=agmr-jdub5r46se-tqiml1-POST-200]
aws_api_gateway_integration_response.post_integration_response: Refreshing state... [id=agir-jdub5r46se-tqiml1-POST-200]
aws_api_gateway_integration.post_integration: Refreshing state... [id=agi-jdub5r46se-tqiml1-POST]
data.aws_secretsmanager_secret.secret: Reading...
aws_route53_record.thomaskimble_outlook_mx_record: Refreshing state... [id=Z06242472H0DG7GFLG30T__MX]
aws_route53_record.thomaskimble_txt_records: Refreshing state... [id=Z06242472H0DG7GFLG30T__TXT]
aws_route53_record.thomaskimble_outlook_autodiscover_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_autodiscover_CNAME]
aws_route53_record.thomaskimble_github_pages_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_legacy_CNAME]
aws_route53_record.thomaskimble_email_secureserver_record: Refreshing state... [id=Z06242472H0DG7GFLG30T_email_CNAME]
data.aws_secretsmanager_secret.secret: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
data.aws_secretsmanager_secret_version.current: Reading...
aws_api_gateway_resource.get_projects: Refreshing state... [id=tqiml1]
data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
aws_route53_record.thomaskimble_records["*.thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
aws_route53_record.thomaskimble_records["thomaskimble.com"]: Refreshing state... [id=Z06242472H0DG7GFLG30T__fbc2c044fdd8abcc48ea06273249c30c.thomaskimble.com._CNAME]
aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d393xlsrttjy5b]
aws_api_gateway_deployment.api_deployment: Refreshing state... [id=nxvnsk]
aws_api_gateway_stage.prod: Refreshing state... [id=ags-jdub5r46se-prod]
aws_acm_certificate_validation.thomaskimble_certificate_validation: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_amplify_branch.dev: Refreshing state... [id=d393xlsrttjy5b/dev]
aws_amplify_branch.main: Refreshing state... [id=d393xlsrttjy5b/main]
aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d393xlsrttjy5b/thomaskimble.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "api_deployment" {
      ~ created_date  = "2024-05-15T10:26:47Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-west-1:287212251408:jdub5r46se/" -> (known after apply)
      ~ id            = "nxvnsk" -> (known after apply)
      ~ invoke_url    = "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          - "redeployment" = "a9507ae55bdde37b8ad88445ed9f13a676acec21"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_integration.get_integration will be created
  + resource "aws_api_gateway_integration" "get_integration" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "GET"
      + id                   = (known after apply)
      + passthrough_behavior = "WHEN_NO_MATCH"
      + request_templates    = {
          + "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        }
      + resource_id          = "tqiml1"
      + rest_api_id          = "jdub5r46se"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # aws_api_gateway_integration.post_integration will be destroyed
  # (because aws_api_gateway_integration.post_integration is not in configuration)
  - resource "aws_api_gateway_integration" "post_integration" {
      - cache_key_parameters = [] -> null
      - cache_namespace      = "tqiml1" -> null
      - connection_type      = "INTERNET" -> null
      - http_method          = "POST" -> null
      - id                   = "agi-jdub5r46se-tqiml1-POST" -> null
      - passthrough_behavior = "WHEN_NO_MATCH" -> null
      - request_parameters   = {} -> null
      - request_templates    = {
          - "application/json" = <<-EOT
                {
                        "statusCode": 200
                      }
            EOT
        } -> null
      - resource_id          = "tqiml1" -> null
      - rest_api_id          = "jdub5r46se" -> null
      - timeout_milliseconds = 29000 -> null
      - type                 = "MOCK" -> null
    }

  # aws_api_gateway_integration_response.get_integration_response will be created
  + resource "aws_api_gateway_integration_response" "get_integration_response" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "tqiml1"
      + response_templates = {
          + "application/json" = <<-EOT
                {
                          "title": "About Me",
                          "date": "2024-05-14T15:23:56Z",
                          "bodyClass": "page-about",
                          "sections": [
                              {
                                  "type": "text",
                                  "content": "My name is **Thomas Oliver Kimble**, an engineer with a rich blend of skills and interests, encompassing data science, robotics, cloud engineering, and a strong passion for both music and design."
                              },
                              {
                                  "type": "image",
                                  "src": "/images/about/me.jpg"
                              },
                              {
                                  "type": "header",
                                  "content": "Personal Life"
                              },
                              {
                                  "type": "text",
                                  "content": "Originally from England, I moved to Switzerland when I was three and later to France. My education was mainly in Switzerland, where I pursued engineering—a field that aligned perfectly with my passion for math, science, and design. This combination of interests led me to explore both the analytical and creative sides of my personality, particularly through music. From the age of seven, I was immersed in music, playing in bands and learning instruments like the guitar, drums, and piano."
                              }
                          ]
                      }
            EOT
        }
      + rest_api_id        = "jdub5r46se"
      + status_code        = "200"
    }

  # aws_api_gateway_integration_response.post_integration_response will be destroyed
  # (because aws_api_gateway_integration_response.post_integration_response is not in configuration)
  - resource "aws_api_gateway_integration_response" "post_integration_response" {
      - http_method         = "POST" -> null
      - id                  = "agir-jdub5r46se-tqiml1-POST-200" -> null
      - resource_id         = "tqiml1" -> null
      - response_parameters = {} -> null
      - response_templates  = {
          - "application/json" = <<-EOT
                {
                          "title": "About Me",
                          "date": "2024-05-14T15:23:56Z",
                          "bodyClass": "page-about",
                          "sections": [
                              {
                                  "type": "text",
                                  "content": "My name is **Thomas Oliver Kimble**, an engineer with a rich blend of skills and interests, encompassing data science, robotics, cloud engineering, and a strong passion for both music and design."
                              },
                              {
                                  "type": "image",
                                  "src": "/images/about/me.jpg"
                              },
                              {
                                  "type": "header",
                                  "content": "Personal Life"
                              },
                              {
                                  "type": "text",
                                  "content": "Originally from England, I moved to Switzerland when I was three and later to France. My education was mainly in Switzerland, where I pursued engineering—a field that aligned perfectly with my passion for math, science, and design. This combination of interests led me to explore both the analytical and creative sides of my personality, particularly through music. From the age of seven, I was immersed in music, playing in bands and learning instruments like the guitar, drums, and piano."
                              }
                          ]
                      }
            EOT
        } -> null
      - rest_api_id         = "jdub5r46se" -> null
      - status_code         = "200" -> null
    }

  # aws_api_gateway_method.get_method will be created
  + resource "aws_api_gateway_method" "get_method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "tqiml1"
      + rest_api_id      = "jdub5r46se"
    }

  # aws_api_gateway_method.post_method will be destroyed
  # (because aws_api_gateway_method.post_method is not in configuration)
  - resource "aws_api_gateway_method" "post_method" {
      - api_key_required     = false -> null
      - authorization        = "NONE" -> null
      - authorization_scopes = [] -> null
      - http_method          = "POST" -> null
      - id                   = "agm-jdub5r46se-tqiml1-POST" -> null
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      - resource_id          = "tqiml1" -> null
      - rest_api_id          = "jdub5r46se" -> null
    }

  # aws_api_gateway_method_response.get_method_response will be created
  + resource "aws_api_gateway_method_response" "get_method_response" {
      + http_method     = "GET"
      + id              = (known after apply)
      + resource_id     = "tqiml1"
      + response_models = {
          + "application/json" = "Empty"
        }
      + rest_api_id     = "jdub5r46se"
      + status_code     = "200"
    }

  # aws_api_gateway_method_response.post_method_response will be destroyed
  # (because aws_api_gateway_method_response.post_method_response is not in configuration)
  - resource "aws_api_gateway_method_response" "post_method_response" {
      - http_method         = "POST" -> null
      - id                  = "agmr-jdub5r46se-tqiml1-POST-200" -> null
      - resource_id         = "tqiml1" -> null
      - response_models     = {
          - "application/json" = "Empty"
        } -> null
      - response_parameters = {} -> null
      - rest_api_id         = "jdub5r46se" -> null
      - status_code         = "200" -> null
    }

  # aws_api_gateway_stage.prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod" {
      ~ deployment_id         = "nxvnsk" -> (known after apply)
        id                    = "ags-jdub5r46se-prod"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 5 to destroy.

Changes to Outputs:
  ~ api_deployment_arn = "arn:aws:execute-api:eu-west-1:287212251408:jdub5r46se/" -> (known after apply)
  ~ api_gateway_url    = "https://jdub5r46se.execute-api.eu-west-1.amazonaws.com/" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*